const holidayData = {
    "holidays": [
        {
            "id": "h1",
            "date": "2026-01-01",
            "title": "신정",
            "type": "공휴일"
        },
        {
            "id": "h2",
            "date": "2026-02-17",
            "title": "설날",
            "type": "명절"
        },
        {
            "id": "h3",
            "date": "2026-03-01",
            "title": "삼일절",
            "type": "공휴일"
        },
        {
            "id": "h4",
            "date": "2026-05-05",
            "title": "어린이날",
            "type": "명절"
        },
        {
            "id": "h5",
            "date": "2026-06-06",
            "title": "현충일",
            "type": "명절"
        },
        {
            "id": "h6",
            "date": "2026-07-17",
            "title": "제헌절",
            "type": "명절"
        },
        {
            "id": "h7",
            "date": "2026-08-15",
            "title": "광복절",
            "type": "공휴일"
        },
        {
            "id": "h8",
            "date": "2026-09-25",
            "title": "추석",
            "type": "명절"
        },
        {
            "id": "h9",
            "date": "2026-10-03",
            "title": "개천절",
            "type": "공휴일"
        },
        {
            "id": "h10",
            "date": "2026-10-09",
            "title": "한글날",
            "type": "명절"
        },
        {
            "id": "h11",
            "date": "2026-12-25",
            "title": "크리스마스",
            "type": "명절"
        }
    ]
};